
; -----------------------------------------
; нарисовать окно в нижней части экрана
; BC=#0E00, DE=#081E, #73FE строит рамку с атрибутом A
; In:
;   AF, A атрибут окна
; Out:
;   нижняя рамка по BC=#0E00 с внутренними размерами DE=#081E нарисована, IX и IY сохранены
; Corrupt:
;   HL, DE, BC, AF
; -----------------------------------------
BottomFrame     LD BC, #0E00
                LD DE, #081E
                CALL DrawFrame                                                  ; нарисовать рамку окна из восьми одноклеточных элементов
                RET
