
; -----------------------------------------
; вычислить ZX-адрес верхней пиксельной строки знакоместа
; B строка знакомест, C столбец, HL экранный адрес в нелинейной области #4000..#57FF, BC сохранён
; In:
;   BC, B строка знакомест 0..23 и C столбец байтов 0..31
; Out:
;   HL адрес первой пиксельной строки знакоместа, BC сохранён
; Corrupt:
;   HL, AF, DE, IX, IY не меняются
; -----------------------------------------
CellAddress     PUSH BC
                LD HL, #0800
                LD A, B
                SRL A
                RR L
                SRL A
                RR L
                SRL A
                RR L
                OR H
                RLCA
                RLCA
                RLCA
                LD H, A
                LD B, #00
                ADD HL, BC
                POP BC
                RET
