
; -----------------------------------------
; очистить рабочую область логического банка 8
; сохраняет банк, включает 8, заполняет нулём #C000..#D8EF включительно, восстанавливает банк,
; регистры HL, DE, BC, AF сохранены
; In:
;   состояние рабочих таблиц и текущий логический банк
; Out:
;   HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, альтернативные регистры не используются в собственном
;   коде, возможные прерывания работают независимо
; -----------------------------------------
ClearBank8      PUSH HL
                PUSH BC
                PUSH DE
                PUSH AF
                LD A, (State.Bank)
                PUSH AF
                LD A, #08
                CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                LD HL, Memory.Window                                            ; начало выбранного окна расширенной RAM
                LD DE, Memory.Window + 1                                        ; следующий байт при очистке рабочего банка8
                LD BC, #18EF
                LD (HL), #00
                LDIR
                POP AF
                CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                POP AF
                POP DE
                POP BC
                POP HL
                RET
