
; -----------------------------------------
; очистить основную область слева от боковой панели
; BC=#0400, DE=#1414, A=0, #73CF обнуляет пиксели и атрибуты
; In:
;   параметры не требуются
; Out:
;   прямоугольник 20 на 20 знакомест отстроки 4 очищен, HL, IX, IY сохранены, DE=#1414, A=0
; Corrupt:
;   DE, BC и F через завершающий #73AD, экран и атрибуты
; -----------------------------------------
ClearLeftPanel  LD BC, #0400
                LD DE, #1414
                XOR A
                CALL ClearRectangle                                             ; обнулить пиксели прямоугольника и заполнить его атрибуты
                RET
