
; -----------------------------------------
; сдвинуть указатель меню на пиксель вправо
; старый X=#79CA, сравнивается с правой границей IX+3, при допустимости новый X+1 сохраняется
; #79CC
; In:
;   IX описатель границ меню, старая позиция #79CA/#79CB
; Out:
;   новая координата X=X+1 записана в #79CC/#79CD, если старая не равна IX+3, при равенстве
;   память не меняется, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF
; -----------------------------------------
CursorRight     LD A, (Engine.ShiftCursorL.OldCursor)
                CP (IX + FMenuHeader.MaxX)                                      ; +#03, максимальная X указателя
                RET Z                                                           ; выход, если указатель уже находится на правой границе меню

                INC A
                LD (Engine.ShiftCursorL.NewCursor), A
                RET
