
; -----------------------------------------
; сдвинуть указатель меню на пиксель вверх
; старый Y=#79CB, сравнивается с верхней границей IX+2, при допустимости новый Y-1 сохраняется
; #79CD
; In:
;   IX описатель границ меню, старая позиция #79CA/#79CB
; Out:
;   новая координата Y=Y-1 записана в #79CC/#79CD, если старая не равна IX+2, при равенстве
;   память не меняется, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF
; -----------------------------------------
CursorUp        LD A, (Engine.ShiftCursorL.OldCursorY)
                CP (IX + FMenuHeader.MinY)                                      ; +#02, минимальная Y указателя
                RET Z                                                           ; выход, если указатель уже находится на верхней границе меню

                DEC A
                LD (Engine.ShiftCursorL.NewCursorY), A
                RET
