
; -----------------------------------------
; сдвинуть указатель меню на пиксель вниз
; старый Y=#79CB, сравнивается с нижней границей IX+4, при допустимости новый Y+1 сохраняется
; #79CD
; In:
;   IX описатель границ меню, старая позиция #79CA/#79CB
; Out:
;   новая координата Y=Y+1 записана в #79CC/#79CD, если старая не равна IX+4, при равенстве
;   память не меняется, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF
; -----------------------------------------
CursorDown      LD A, (Engine.ShiftCursorL.OldCursorY)
                CP (IX + FMenuHeader.MaxY)                                      ; +#04, максимальная Y указателя
                RET Z                                                           ; выход, если указатель уже находится на нижней границе меню

                INC A
                LD (Engine.ShiftCursorL.NewCursorY), A
                RET
