
; -----------------------------------------
; сдвинуть указатель меню на пиксель влево
; старый X=#79CA, сравнивается с левой границей IX+1, при допустимости новый X-1 сохраняется #79CC
; In:
;   IX описатель границ меню, старая позиция #79CA/#79CB
; Out:
;   новая координата X=X-1 записана в #79CC/#79CD, если старая не равна IX+1, при равенстве
;   память не меняется, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF
; -----------------------------------------
CursorLeft      LD A, (Engine.ShiftCursorL.OldCursor)
                CP (IX + FMenuHeader.MinX)                                      ; +#01, минимальная X указателя
                RET Z                                                           ; выход, если указатель уже находится на левой границе меню

                DEC A
                LD (Engine.ShiftCursorL.NewCursor), A
                RET
