
; -----------------------------------------
; вывести символ из прерывания с сохранением режима DI
; патчит операнды CALL в #703B и #708D на #5FA1, затем вызывает #702B, обработчик прерывания
; сохраняет прежние значения этих операндов
; In:
;   BC позиция, B строка знакомест и C горизонтальный индекс, AF код символа A
; Out:
;   символ выведен, HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, патчатся операнды #703B/#708D, переключатель #5FA1
;   оставляет прерывания запрещёнными
; -----------------------------------------
DrawGlyphDI     PUSH HL
                LD HL, State.BankDriver
                LD (Engine.DrawGlyph.EnterPageCall), HL
                LD (Engine.DrawGlyph.LeavePageCall), HL
                CALL DrawGlyph                                                  ; нарисовать восьмистрочный символ шрифта
                POP HL
                RET
