
; -----------------------------------------
; нарисовать фон объекта 4 на 4 знакоместа
; HL ресурс, A=0 вызывает #7545, A!=0 вызывает зеркальный #75E1
; In:
;   HL графика 4 на 4 знакоместа, BC позиция, AF, A=0 обычно либо A!=0 зеркально
; Out:
;   фон объекта выведен, HL, BC, A, IX, IY сохранены, DE=#0404
; Corrupt:
;   DE и F, F соответствует проверке OR A перед выводом
; -----------------------------------------
DrawBackLayer   PUSH IX
                PUSH HL
                POP IX
                LD DE, #0404
                OR A
                JR NZ, .DrawMirrored                                            ; переход, если запрошено горизонтальное отражение фона

                CALL DrawRawSprite                                              ; вывести непрозрачный спрайт с атрибутами
                POP IX
                RET

.DrawMirrored   CALL DrawRawMirrored                                            ; вывести непрозрачный спрайт с горизонтальным отражением
                POP IX
                RET
