
; -----------------------------------------
; вывести символ с обычной процедурой переключения банка
; патчит операнды CALL в #703B и #708D на #6D2F, затем вызывает #702B
; In:
;   BC позиция, B строка знакомест и C горизонтальный индекс, AF код символа A
; Out:
;   символ выведен, HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, патчатся операнды #703B/#708D, прерывания разрешаются
;   процедурой #6D2F
; -----------------------------------------
DrawGlyphEI     PUSH HL
                LD HL, Engine.PageEI                                            ; адрес обычного переключателя банка для операндов CALL шрифта
                LD (Engine.DrawGlyph.EnterPageCall), HL
                LD (Engine.DrawGlyph.LeavePageCall), HL
                CALL DrawGlyph                                                  ; нарисовать восьмистрочный символ шрифта
                POP HL
                RET
