
; -----------------------------------------
; найти исходный адрес и размер оверлея
; HL начинается с #C000, пропускает A-1 блоков по маркеру overlay, затем находит конец текущего
; блока, возвращает HL началом, BC длиной, длина включает семибайтный конечный маркер
; In:
;   AF, A номер блока внутри банка начиная с 1, банк оверлеев уже выбран
; Out:
;   HL начало блока, DE длина блока, BC та же длина, длина включает маркер overlay
; Corrupt:
;   HL, DE, BC, AF, IX и IY не меняются, предел поиска не задан
; -----------------------------------------
FindOverlay     LD HL, Overlay.Storage                                          ; начало выбранного банка хранения оверлеев

                ; переход между оверлеями по конечному маркеру предыдущего блока
.SkipOverlay    DEC A
                JR Z, .MeasureBlock                                             ; переход, если достигнут номер нужного оверлея

                PUSH AF
                CALL FindOverlayEnd                                             ; найти следующий семибайтный маркер overlay
                POP AF
                JR .SkipOverlay

                ; длина выбранного оверлея определяется разностью адресов
.MeasureBlock   PUSH HL
                CALL FindOverlayEnd                                             ; найти следующий семибайтный маркер overlay
                POP DE
                OR A
                SBC HL, DE
                PUSH HL
                POP BC
                EX DE, HL
                RET
