
; -----------------------------------------
; сформировать имя типа отряда со специальным окончанием
; A ID описателя #8036, в #7EE9 копируется первая часть имени до последнего символа перед пробелом
; либо 0, затем добавляется строка-окончание из списка #7EF7 по ID, буфер заканчивается 0
; In:
;   AF, A ID типа 1..25
; Out:
;   в #7EE9 сформировано имя с нужным окончанием и 0, HL, DE, BC, AF, IX, IY сохранены, банк 3
;   выбран
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, изменяется буфер #7EE9, банк и IFF, предыдущий банк здесь
;   не восстанавливается
; -----------------------------------------
FormatUnitName  PUSH HL
.CharAhead      EQU 1                                                           ; следующий символ относительно текущего указателя текста
                PUSH DE
                PUSH BC
                PUSH AF
                PUSH IX
                PUSH AF
                CALL UnitDesc                                                   ; получить описатель типа отряда
                LD HL, Engine.FormatUnitName.NameBuffer                         ; буфер имени типа существа с выбранным окончанием
.ScanName       LD A, (IX + .CharAhead)
                OR A
                JR Z, .SelectSuffix                                             ; переход, если достигнут конец базового имени существа

                CP #20
                JR Z, .SelectSuffix                                             ; переход, если достигнуто заполнение имени пробелами

                LD A, (IX + #00)
                LD (HL), A
                INC IX
                INC HL
                JR .ScanName

                ; добавление окончания по варианту, выбранному для численности
.SelectSuffix   POP BC
                LD IX, Engine.FormatUnitName.Suffixes - 1                       ; нулевая строка перед окончаниями имён25типов существ
.SkipSuffix     INC IX
                LD A, (IX + #00)
                OR A
                JR NZ, .SkipSuffix                                              ; переход, если не достигнут конец пропускаемого окончания

                DJNZ .SkipSuffix

                INC IX
.CopySuffix     LD A, (IX + #00)
                LD (HL), A
                OR A
                INC IX
                INC HL
                JR NZ, .CopySuffix                                              ; переход, если не достигнут конец копируемого окончания

                POP IX
                POP AF
                POP BC
                POP DE
                POP HL
                RET

.ArmyUnitText   EQU $                                                           ; общий формат имени и количества типа отряда
.NameBuffer     EQU $                                                           ; буфер имени типа существа с выбранным окончанием
                DB #00, #00, #00, #00, #00, #00, #00, #00
.Suffixes       EQU $+7                                                         ; нулевая строка перед окончаниями имён25типов существ
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #AE, #A2, #00, #00, #AE, #A2, #00, #A5
                DB #A2, #00, #AE, #A2, #00, #A5, #A9, #00
                DB #AE, #A2, #00, #AE, #A2, #00, #AE, #A2
                DB #00, #AE, #A2, #00, #AE, #A2, #00, #AE
                DB #A2, #00, #AE, #A2, #00, #A5, #A9, #00
                DB #AE, #A2, #00, #AE, #A2, #00, #AE, #A2
                DB #00, #AE, #A2, #00, #A8, #00, #A9, #00
                DB #AE, #A2, #00, #AE, #A2, #00, #AE, #A2
                DB #00, #AE, #A2, #00, #AE, #A2, #00
