
; -----------------------------------------
; найти активную запись с заданным владельцем
; вход B сравнивается с полем+19, до 80 записей по 35 байт в логическом банке 0 от #C000,
; проверяется сброшенный бит 0 поля 0, zero отражает найденное совпадение, все изменённые регистры
; явно восстанавливаются, указатель IX наружу не возвращается
; In:
;   BC, B искомый владелец
; Out:
;   AF, Z=1 если найдена активная запись с данным владельцем, A исходный логический банк, HL,
;   DE, BC, IX, IY сохранены, банк восстановлен
; Corrupt:
;   AF, IFF разрешён, указатель найденной записи IX наружу не возвращается
; -----------------------------------------
HasOwnerCastle  PUSH IX
                PUSH DE
                PUSH BC
                LD A, (State.Bank)
                PUSH AF
                XOR A
                CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                LD IX, State.AllCastles                                         ; физические записи замков логического банка0
                LD A, B
                LD B, #50
                LD DE, #0023
.CastleLoop     BIT CASTLE_OFF_BIT, (IX + FCastle.Flags)                        ; +#00, бит 0 выключает запись, значения остальных битов отдельно не установлены
                JR NZ, .NextCastle                                              ; переход, если замок исключён из обработки

                CP (IX + FCastle.Owner)                                         ; +#13, 0 собственный замок, 1..15 правитель FRuler, #FF особое отсутствие правителя/банды
                JR Z, .RestorePage                                              ; переход, если замок принадлежит искомому владельцу

.NextCastle     ADD IX, DE
                DJNZ .CastleLoop

                OR A
.RestorePage    POP BC
                LD A, B
                CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                POP BC
                POP DE
                POP IX
                RET
