
; -----------------------------------------
; сместить IX к четырёхбайтной записи с индексом A
; IX=IX+4*A, BC сохранён
; In:
;   AF, A индекс 0..63, IX начало четырёхбайтных записей
; Out:
;   IX=IX исходный+4*A, HL, DE, BC, A, IY сохранены
; Corrupt:
;   IX и F, для A>=64 происходит усечение 4*A до 8 бит перед сложением
; -----------------------------------------
IndexFourBytes  PUSH BC
                LD C, A
                LD B, #00
                SLA C
                SLA C
                ADD IX, BC
                POP BC
                RET
