
; -----------------------------------------
; получить маску по текущему байту местности
; A=#8BD9, преобразование #867D, результат L
; In:
;   #8BD9 байт местности текущего шага
; Out:
;   HL, L маска из #867D и H сохранён, DE, BC, IX, IY сохранены
; Corrupt:
;   L, AF
; -----------------------------------------
MoveMask        LD A, (Engine.ApplyMoveCode.TargetTile)
                CALL TerrainMask                                                ; преобразовать младшие шесть бит байта местности по таблице порогов
                LD L, A
                RET
