
; -----------------------------------------
; преобразовать направление к цели в команду движения героя
; BC=#6A2E текущая позиция, DE=#69D5 цель, #7C71 возвращает направление A, код из таблицы #7F56
; передаётся обработчику #8A31
; In:
;   #6A2E текущая позиция героя, #69D5 цель
; Out:
;   направление к цели преобразовано в команду #8A31, возможен шаг героя либо переход обратно к
;   ожиданию ввода
; Corrupt:
;   HL, DE, BC, AF, IX, IY и состояние движения, обычный RET зависит от допустимости маршрута в
;   #8A31
; -----------------------------------------
MoveToTarget    LD BC, (State.Position)
                LD DE, (State.MoveTarget)
                CALL GetDirection                                               ; определить одно из восьми направлений от BC к DE
                LD B, #00
                LD C, A
                LD HL, Engine.MoveToTarget.MoveCommands - 1                     ; восемь команд для направлений GetDirection с нумерацией1..8
                ADD HL, BC
                LD A, (HL)
                CALL ApplyMoveCode                                              ; применить уже полученный код движения к позиции героя
                RET

.MoveCommands   EQU $                                                           ; восемь команд для направлений GetDirection с нумерацией1..8
                DB #1B, #23, #22, #21, #19, #11, #12, #13
