
; -----------------------------------------
; вывести сообщение о нехватке денег
; A=#42 для #8712, затем #7117 печатает по BC=#1208 строку #872B «Денежки, денежки-то где ?»
; In:
;   параметры не требуются
; Out:
;   нижняя рамка и сообщение о нехватке денег выведены, IX и IY сохранены
; Corrupt:
;   HL, DE, BC, AF, рабочие поля форматирования текста
; -----------------------------------------
NeedMoreMoney   LD A, #42
                CALL BottomFrame                                                ; нарисовать окно в нижней части экрана
                LD BC, #1208
                LD DE, Engine.NeedMoreMoney.NeedGoldText                        ; сообщение о нехватке денег
                CALL PrintMessage                                               ; разобрать строку сообщения с управляющими кодами
                RET

.NeedGoldText   EQU $                                                           ; сообщение о нехватке денег
                DB #84, #A5, #AD, #A5, #A6, #AA, #A8, #2C
                DB #20, #A4, #A5, #AD, #A5, #A6, #AA, #A8
                DB #2D, #E2, #AE, #20, #A3, #A4, #A5, #20
.AttackText     EQU $+2                                                         ; общие надписи Атакую и Отхожу перед сражением
                DB #3F, #00, #80, #E2, #A0, #AA, #E3, #EE
                DB #0D, #22, #8E, #E2, #E5, #AE, #A6, #E3
.QuantityText   EQU $+3                                                         ; общее приглашение Сколько для ввода количества
                DB #0D, #22, #00, #91, #AA, #AE, #AB, #EC
.ArmyFullText   EQU $+5                                                         ; сообщение о заполнении всех пяти типов армии
                DB #AA, #AE, #20, #3F, #00, #82, #20, #A2
                DB #A0, #E8, #A5, #A9, #20, #A0, #E0, #AC
                DB #A8, #A8, #20, #AD, #A5, #E2, #20, #AC
                DB #A5, #E1, #E2, #A0, #20, #A4, #AB, #EF
.MoneyText      EQU $+6                                                         ; общая надпись денежных средств
                DB #20, #AD, #A0, #E1, #2E, #00, #8D, #A0
.AttackMenu     EQU $+7                                                         ; общий описатель выбора Атакую или Отхожу
                DB #AB, #A8, #E7, #AD, #EB, #A5, #00, #02
                DB #00, #70, #ED, #BF, #C8, #B2, #19, #15
                DB #1F, #16, #19, #16, #1F, #17
