
; -----------------------------------------
; найти строку имени в списке с нулевыми разделителями
; таблица начинается после #69BB, A номер 1.., пропускается A нулевых терминаторов, DE возвращает
; начало следующей строки, HL, BC, AF сохранены
; In:
;   AF, A ненулевой номер строки списка после #69BB
; Out:
;   DE адрес строки, HL, BC, AF, IX, IY сохранены
; Corrupt:
;   DE, нулевой номер не проверяется и запускает 256 проходов DJNZ
; -----------------------------------------
NthName         PUSH HL
                PUSH BC
                PUSH AF
                LD HL, Engine.MainLoop.CultNames - 1                            ; нулевой разделитель перед четырьмя названиями сект
                LD B, A
                XOR A
.SkipName       INC HL
                CP (HL)
                JR NZ, .SkipName                                                ; переход, если не достигнут конец пропускаемого имени

                DJNZ .SkipName

                INC HL
                EX DE, HL
                POP AF
                POP BC
                POP HL
                RET
