
; -----------------------------------------
; выбрать банк хранения по номеру оверлея
; номер <14 выбирает логический банк 12, остальные банк 13
; In:
;   #655E номер оверлея
; Out:
;   AF, A выбранный логический банк 12 либо 13, банк включён, EI
; Corrupt:
;   AF, остальные HL, DE, BC, IX, IY собственный код и установленный драйвер сохраняют
; -----------------------------------------
OverlayBank     LD A, (State.Overlay)
                CP #0E
                LD A, #0C
                JR C, .SelectPage                                               ; переход, если номер оверлея относится к первой группе банков

                INC A
.SelectPage     CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                RET
