
; -----------------------------------------
; переключить логический банк и разрешить прерывания
; CALL #5FA1, EI, RET, собственный формат номера банка реализует RAMDRIVE
; In:
;   AF, A логический банк 0..15
; Out:
;   HL, DE, BC, AF, IX, IY сохранены, #5FA0=A, выбран соответствующий банк, EI
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, IFF заменяется разрешённым состоянием, переключение
;   действует на отображение памяти #C000..#FFFF
; -----------------------------------------
PageEI          CALL State.BankDriver                                           ; переключение логического банка через установленный драйвер памяти
                EI
                RET
