
; -----------------------------------------
; вывести строку с нулевым терминатором
; DE адрес, BC положение, каждый байт выводится #70C5, C и DE увеличиваются, нулевой байт
; завершает
; In:
;   DE строка с нулевым терминатором, BC позиция
; Out:
;   DE у нулевого терминатора, BC, C после последнего символа, B сохранён, HL, IX, IY сохранены
; Corrupt:
;   DE, BC, AF, IFF разрешён вызовом #70C5
; -----------------------------------------
PrintZeroText   LD A, (DE)
                OR A
                RET Z                                                           ; выход, если достигнут нулевой терминатор текста

                CALL DrawGlyphEI                                                ; вывести символ с обычной процедурой переключения банка
                INC C
                INC DE
                JR PrintZeroText
