
; -----------------------------------------
; заменить специальные коды клавиатуры по таблице
; семь пар байтов #6F42, совпавший код заменяется вторым байтом пары
; In:
;   AF, A код символа
; Out:
;   AF, A замена по семи парам #6F42 либо исходный A, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF
; -----------------------------------------
RemapKey        PUSH IX
                PUSH BC
                LD IX, Engine.RemapKey.KeyMap                                   ; семь пар перекодировки специальных клавиш
                LD B, #07
.KeyLoop        CP (IX + FKeyMap.Input)
                JR Z, .KeyFound                                                 ; переход, если код клавиши совпал с записью таблицы перекодировки

                INC IX
                INC IX
                DJNZ .KeyLoop

                JR .RestoreRegs

.KeyFound       LD A, (IX + FKeyMap.Output)
.RestoreRegs    POP BC
                POP IX
                RET

.KeyMap         EQU $                                                           ; семь пар перекодировки специальных клавиш
                DB #C6, #5B, #C5, #5D, #E2, #7E, #C3, #7C
.AltPunct       EQU $+6                                                         ; преобразование шестнадцати кодов пунктуации для альтернативного регистра
                DB #CD, #5C, #CC, #7B, #CB, #7D, #20, #21
                DB #22, #E8, #E9, #ED, #EE, #E7, #EA, #29
.CharTable      EQU $+6                                                         ; таблица преобразования кодов символов, индекс начинается с #20
                DB #2A, #2B, #2C, #2D, #2E, #2F, #20, #21
                DB #22, #98, #99, #9D, #9E, #97, #9A, #29
                DB #2A, #2B, #2C, #2D, #2E, #2F, #30, #31
                DB #32, #33, #34, #35, #36, #37, #38, #39
                DB #3A, #3B, #3C, #3D, #3E, #3F, #40, #80
                DB #81, #96, #84, #85, #94, #83, #95, #88
                DB #89, #8A, #8B, #8C, #8D, #8E, #8F, #9F
                DB #90, #91, #92, #93, #86, #82, #9C, #9B
                DB #87, #5B, #5C, #5D, #5E, #5F, #7F, #A0
                DB #A1, #E6, #A4, #A5, #E4, #A3, #E5, #A8
                DB #A9, #AA, #AB, #AC, #AD, #AE, #AF, #EF
                DB #E0, #E1, #E2, #E3, #A6, #A2, #EC, #EB
                DB #A7, #7B, #7C, #7D, #F3, #F4
