
; -----------------------------------------
; отразить восемь бит байта A
; восемь раз SLA A и RR C, возвращает A с обратным порядком бит, BC сохранён
; In:
;   AF, A исходный байт
; Out:
;   AF, A байт с обратным порядком бит, BC сохранён
; Corrupt:
;   AF, HL, DE, BC, IX, IY не меняются
; -----------------------------------------
ReverseBits     PUSH BC
                LD B, #08
                LD C, #00
.BitLoop        SLA A
                RR C
                DJNZ .BitLoop

                LD A, C
                POP BC
                RET
