
; -----------------------------------------
; сохранить фон под указателем меню
; позиция #79CC, восемь пиксельных строк по 3 байта копируются в #79FE, всего 24 байта
; In:
;   #79CC позиция указателя
; Out:
;   DE=#7A16 после записи 24 байт фона в #79FE..#7A15, BC, B увеличен на 8 от исходной позиции и
;   C сохранён, IX и IY сохранены
; Corrupt:
;   HL, DE, BC, AF, 24 байта буфера фона
; -----------------------------------------
SaveCursor      LD BC, (Engine.ShiftCursorL.NewCursor)
                LD DE, Engine.head_cursorMask.CursorBack                        ; 24-байтный буфер фона под трёхбайтным курсором
                LD A, #08
.PixelRow       PUSH BC
                PUSH AF
                CALL PixelAddress                                               ; вычислить адрес байта экрана по пиксельным координатам
                LDI
                LDI
                LDI
                POP AF
                POP BC
                INC B
                DEC A
                JR NZ, .PixelRow                                                ; переход, если остались пиксельные строки фона курсора

                RET
