
; -----------------------------------------
; выбрать логический банк 10 с текущей картой
; A=10, CALL #6D2F
; In:
;   без параметров
; Out:
;   AF, A=10 при сохранении исходных F, выбран логический банк 10 и EI
; Corrupt:
;   A, состояние банка/IFF, HL, DE, BC, IX, IY и F сохранены
; -----------------------------------------
SelectMapBank   LD A, #0A
                CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                RET
