
; -----------------------------------------
; изменить бит 6 флагов объекта по коду направления
; A=1 либо 5 сохраняет флаг, A2..4 устанавливает бит 6 IX+0, A6..8 сбрасывает бит 6
; In:
;   AF, A направление 1..8, IX запись объекта
; Out:
;   для A=1/5 бит 6IX+0 не меняется, A2..4 устанавливает, A6..8 сбрасывает, HL, DE, BC, A, IX,
;   IY сохранены
; Corrupt:
;   F, кроме условно меняемого бита памяти собственный код не изменяет регистры
; -----------------------------------------
SetFacing       CP #01
                RET Z                                                           ; выход, если направление строго вверх не меняет горизонтальное отражение

                CP #05
                RET Z                                                           ; выход, если направление строго вниз не меняет горизонтальное отражение

                JR C, .SetMirror                                                ; переход, если направление находится в правой половине круга

                RES OBJECT_FACE_BIT, (IX + FMapSite.Flags)                      ; горизонтальное отражение стратегического объекта, направления 2..4 ставят, 6..8 снимают
                RET

.SetMirror      SET OBJECT_FACE_BIT, (IX + FMapSite.Flags)                      ; горизонтальное отражение стратегического объекта, направления 2..4 ставят, 6..8 снимают
                RET
