
; -----------------------------------------
; циклически сдвинуть влево 24 битные строки указателя и маски
; A число сдвигов,16 строк по 3 байта #79CE..#79FD в обратном порядке, крайний левый бит
; возвращается справа, #7A16 уменьшается на каждый сдвиг
; In:
;   AF, A ненулевое число циклических сдвигов влево
; Out:
;   16 трёхбайтных строк #79CE..#79FD сдвинуты, #7A16 уменьшен на число сдвигов, IX и IY
;   сохранены
; Corrupt:
;   HL, DE, BC, AF, C собственный код не меняет, A=0 на выходе, вход A=0 выполнилбы 256 итераций
; -----------------------------------------
ShiftCursorL    PUSH AF
                LD B, #10
                LD HL, Engine.head_cursorMask + 23                              ; последний байт24-байтной маски курсора для обратного прохода
.ShiftRow       PUSH HL
                POP DE
                SLA (HL)
                DEC HL
                RL (HL)
                DEC HL
                RL (HL)
                DEC HL
                JR NC, .NextRow                                                 ; переход, если крайний вытесняемый пиксель строки равен нулю

                EX DE, HL
                SET PIXEL_RIGHT_BIT, (HL)                                       ; младший пиксельный разряд байта, принимающий вытесненный пиксель при сдвиге курсора
                EX DE, HL
.NextRow        DJNZ .ShiftRow

                LD A, (Engine.head_cursorMask.PixelShift)
                DEC A
                LD (Engine.head_cursorMask.PixelShift), A
                POP AF
                DEC A
                JR NZ, ShiftCursorL                                             ; переход, если остались пиксели общего сдвига курсора влево

                RET

.OldCursor      EQU $                                                           ; предыдущая пиксельная позиция указателя
.OldCursorY     EQU $+1                                                         ; предыдущая пиксельная строка указателя
.NewCursor      EQU $+2                                                         ; текущая пиксельная позиция указателя
.NewCursorY     EQU $+3                                                         ; текущая пиксельная строка указателя
                DB #00, #00, #00, #00
head_cursor     INCBIN "Assets/Gfx/raw/head_cursor.ink"                         ; графический ресурс, исходное смещение #1870
head_cursorMask INCBIN "Assets/Gfx/raw/head_cursor.mask"                        ; графический ресурс, исходное смещение #1888
.CursorBack     EQU $                                                           ; 24-байтный буфер фона под трёхбайтным курсором
                DB #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
.PixelShift     EQU $+4                                                         ; текущий циклический сдвиг рисунка и маски указателя
                DB #00, #00, #00, #00, #00
