
; -----------------------------------------
; циклически сдвинуть вправо 24 битные строки указателя и маски
; A число сдвигов,16 строк по 3 байта в #79CE..#79FD, крайний правый бит возвращается слева, #7A16
; увеличивается на каждый выполненный сдвиг
; In:
;   AF, A ненулевое число циклических сдвигов вправо
; Out:
;   16 трёхбайтных строк #79CE..#79FD сдвинуты, #7A16 увеличен на число сдвигов, IX и IY
;   сохранены
; Corrupt:
;   HL, DE, BC, AF, C собственный код не меняет, A=0 на выходе, вход A=0 выполнилбы 256 итераций
; -----------------------------------------
ShiftCursorR    PUSH AF
                LD B, #10
                LD HL, Engine.head_cursor                                       ; существующий рисунок либо маска курсора меню
.ShiftRow       PUSH HL
                POP DE
                SRL (HL)
                INC HL
                RR (HL)
                INC HL
                RR (HL)
                INC HL
                JR NC, .NextRow                                                 ; переход, если крайний вытесняемый пиксель строки равен нулю

                EX DE, HL
                SET PIXEL_LEFT_BIT, (HL)                                        ; старший пиксельный разряд байта, принимающий вытесненный пиксель при сдвиге курсора
                EX DE, HL
.NextRow        DJNZ .ShiftRow

                LD A, (Engine.head_cursorMask.PixelShift)
                INC A
                LD (Engine.head_cursorMask.PixelShift), A
                POP AF
                DEC A
                JR NZ, ShiftCursorR                                             ; переход, если остались пиксели общего сдвига курсора вправо

                RET
