
; -----------------------------------------
; передать байт A на стек калькулятора ROM
; вызов ROM #2D28 с сохранением основных регистров, IX и IY
; In:
;   AF, A беззнаковое целое 0..255
; Out:
;   число добавлено на стек калькулятора ROM, HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, альтернативные HL', DE', BC', AF' зависят от внутреннего
;   соглашения ROM и отдельно не проверены
; -----------------------------------------
StackA          PUSH HL
                PUSH DE
                PUSH BC
                PUSH AF
                PUSH IX
                PUSH IY
                CALL Rom.StackA                                                 ; помещение байтового целого A на стек калькулятора
                POP IY
                POP IX
                POP AF
                POP BC
                POP DE
                POP HL
                RET
