
; -----------------------------------------
; включить обработку объектов в прерывании
; устанавливает бит 2 #6566, AF сохранён
; In:
;   флаг фоновой обработки в #6566
; Out:
;   бит 2 #6566 установлен, HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   регистры не изменяются, меняется только байт #6566
; -----------------------------------------
StartView       PUSH AF
                LD A, (State.ViewFlags)
                SET VIEW_RENDER_BIT, A                                          ; разрешает обновление экранных объектов из прерывания
                LD (State.ViewFlags), A
                POP AF
                RET
