
; -----------------------------------------
; сформировать три варианта шага вверх
; IY массив трёх записей [0, X, Y], уменьшает байты+2,+4,+5,+8 и увеличивает+7, получается
; центрвверх и две соседние диагонали
; In:
;   IY начало трёх записей [тип, C, B] по 3 байта
; Out:
;   координаты трёх кандидатов изменены согласно направлению процедуры, HL, DE, BC, A, IX, IY
;   сохранены
; Corrupt:
;   F кроме входного C, поскольку INC/DEC памяти carry не изменяют
; -----------------------------------------
StepsUp         DEC (IY + FMoveStepA3.First.Y)
                DEC (IY + FMoveStepA3.Second.X)
                DEC (IY + FMoveStepA3.Second.Y)
                INC (IY + FMoveStepA3.Third.X)
                DEC (IY + FMoveStepA3.Third.Y)
                RET
