
; -----------------------------------------
; сформировать три варианта шага вниз-влево
; уменьшает IY+1,+4 и увеличивает+2,+8
; In:
;   IY начало трёх записей [тип, C, B] по 3 байта
; Out:
;   координаты трёх кандидатов изменены согласно направлению процедуры, HL, DE, BC, A, IX, IY
;   сохранены
; Corrupt:
;   F кроме входного C, поскольку INC/DEC памяти carry не изменяют
; -----------------------------------------
StepsDownLeft   DEC (IY + FMoveStepA3.First.X)
                INC (IY + FMoveStepA3.First.Y)
                DEC (IY + FMoveStepA3.Second.X)
                INC (IY + FMoveStepA3.Third.Y)
                RET
