
; -----------------------------------------
; сформировать три варианта шага вверх-вправо
; изменяет байты кандидатов IY+1(+1),+2(-1),+5(-1),+7(+1), три направления вокруг диагонали
; In:
;   IY начало трёх записей [тип, C, B] по 3 байта
; Out:
;   координаты трёх кандидатов изменены согласно направлению процедуры, HL, DE, BC, A, IX, IY
;   сохранены
; Corrupt:
;   F кроме входного C, поскольку INC/DEC памяти carry не изменяют
; -----------------------------------------
StepsUpRight    INC (IY + FMoveStepA3.First.X)
                DEC (IY + FMoveStepA3.First.Y)
                DEC (IY + FMoveStepA3.Second.Y)
                INC (IY + FMoveStepA3.Third.X)
                RET
