
; -----------------------------------------
; выключить обработку объектов в прерывании
; сбрасывает бит 2 в #6566, AF сохранён
; In:
;   флаг фоновой обработки в #6566
; Out:
;   бит 2 #6566 сброшен, HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   регистры не изменяются, меняется только байт #6566
; -----------------------------------------
StopView        PUSH AF
                LD A, (State.ViewFlags)
                RES VIEW_RENDER_BIT, A                                          ; разрешает обновление экранных объектов из прерывания
                LD (State.ViewFlags), A
                POP AF
                RET
