
; -----------------------------------------
; преобразовать младшие шесть бит байта местности по таблице порогов
; A AND#3F, пары порог/результат после #868A, выбирается результат первого порога строго больше A,
; HL сохранён
; In:
;   AF, A байт местности
; Out:
;   AF, A результат первой таблицы порогов, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF, диапазон A сначала ограничивается младшими шестью битами
; -----------------------------------------
TerrainMask     PUSH HL
                AND #3F
                LD HL, Engine.TerrainMask.TerrainMasks - 1                      ; пары порог местности и маска способностей
.ThresholdLoop  INC HL
                CP (HL)
                INC HL
                JR NC, .ThresholdLoop                                           ; переход, если код местности ещё не меньше очередного табличного порога

                LD A, (HL)
                POP HL
                RET

.TerrainMasks   EQU $                                                           ; пары порог местности и маска способностей
                DB #01, #00, #09, #FF, #11, #10, #19, #20
                DB #21, #08, #29, #00
