
; -----------------------------------------
; преобразовать местность по второй таблице порогов
; A AND#3F, пары порог/результат после #86A4, выбирается результат первого порога строго больше A,
; HL сохранён
; In:
;   AF, A байт местности
; Out:
;   AF, A результат второй таблицы порогов, HL, DE, BC, IX, IY сохранены
; Corrupt:
;   AF, диапазон A сначала ограничивается младшими шестью битами
; -----------------------------------------
TerrainBattle   PUSH HL
                AND #3F
                LD HL, Engine.TerrainBattle.BattleClasses - 1                   ; пары порог местности и вид боевого поля
.ThresholdLoop  INC HL
                CP (HL)
                INC HL
                JR NC, .ThresholdLoop                                           ; переход, если код местности ещё не меньше очередного табличного порога

                LD A, (HL)
                POP HL
                RET

.BattleClasses  EQU $                                                           ; пары порог местности и вид боевого поля
                DB #01, #01, #09, #06, #11, #04, #19, #05
                DB #21, #03, #29, #02
