
; -----------------------------------------
; прочитать пару флагов описателя отряда
; A ID, возвращает DE из полей 13/14 описателя SOLDIERS, сохраняет исходный банк, IX, BC, AF
; In:
;   AF, A ID типа отряда
; Out:
;   DE два байта флагов описателя +13/+14, HL, BC, AF, IX, IY сохранены, банк восстановлен
; Corrupt:
;   DE, прочие основные и индексные регистры сохранены
; -----------------------------------------
UnitFlags       PUSH IX
                PUSH BC
                PUSH AF
                LD B, A
                LD A, (State.Bank)
                PUSH AF
                LD A, B
                CALL UnitDesc                                                   ; получить описатель типа отряда
                LD E, (IX + FSoldier.MoveFlags)                                 ; +#0D, способности передвижения и атаки
                LD D, (IX + FSoldier.ExtraFlags)                                ; +#0E, дополнительные свойства типа
                POP AF
                CALL PageEI                                                     ; переключить логический банк и разрешить прерывания
                POP AF
                POP BC
                POP IX
                RET
