
; -----------------------------------------
; выдержать двадцать прерываний
; B=20 и цикл HALT/DJNZ, исходный BC сохранён
; In:
;   маскируемые прерывания должны быть разрешены, иначе HALT может не завершиться
; Out:
;   выполнены 20 последовательных HALT, HL, DE, BC, AF, IX, IY сохранены
; Corrupt:
;   HL, DE, BC, AF, IX, IY сохранены, собственный код не затрагивает альтернативные регистры
; -----------------------------------------
Wait20Frames    PUSH BC
                LD B, #14
.FrameLoop      HALT
                DJNZ .FrameLoop

                POP BC
                RET
