
; -----------------------------------------
; сложить стоимостные оценки отрядов армии
; помещает ноль на стек ROM, до пяти плотных записей IY с шагом 18 умножают float5 количества на
; слово описателя типа +26..27, токены 04,0F добавляют произведение к сумме, ID0 завершает список
; In:
;   IY начало армии
; Out:
;   оценка армии на стеке ROM, IY продвинут
; Corrupt:
;   HL, DE, BC, AF, IX, IY, состояние калькулятора и текущий банк, выбираемый 8036
; -----------------------------------------
ArmyValue       XOR A
                CALL Engine.StackA                                              ; передать байт A на стек калькулятора ROM
                LD B, #05
.UnitValueLoop  LD A, (IY + FBattleUnit.UnitID)                                 ; +#00, ID типа, 0 завершает плотный список
                OR A
                RET Z                                                           ; выход, если список отрядов завершён

                PUSH BC
                CALL Engine.UnitDesc                                            ; получить описатель типа отряда
                PUSH IY
                POP HL
                INC HL
                INC HL
                CALL Engine.StackFloat5                                         ; передать пятибайтное число по HL на стек калькулятора
                LD C, (IX + FSoldier.BattleValue.Low)                           ; +#1A, младший байт, вес одного воина в общей оценке армии при начале и завершении боя
                LD B, (IX + FSoldier.BattleValue.High)                          ; +#1B, старший байт, вес одного воина в общей оценке армии при начале и завершении боя
                CALL Engine.StackBC                                             ; передать целое BC на стек калькулятора ROM
                PUSH IY
                RST #28                                                         ; передача вычисления стековому калькулятору ПЗУ, токены следуют ниже
                DB #04                                                          ; multiply, умножение, F4C6
                DB #0F                                                          ; addition, сложение, F4C7
                DB #38                                                          ; end-calc, возврат в Z80, F4C8
                POP IY
                LD DE, #0012
                ADD IY, DE
                POP BC
                DJNZ .UnitValueLoop

                RET
