
; -----------------------------------------
; уменьшить столбец клетки без выхода за левый край
; при C=0 оставляет столбец без изменения, иначе уменьшает C
; In:
;   BC клетка
; Out:
;   BC новая клетка, AF изменён
; Corrupt:
;   BC и AF, меняются C и флаги, HL, DE, B, IX, IY сохранены
; -----------------------------------------
CellLeft        LD A, C
                OR A
                RET Z                                                           ; выход, если клетка уже в левом столбце

                DEC C
                RET
