
; -----------------------------------------
; увеличить строку клетки без выхода за нижний край
; при B=4 оставляет строку без изменения, иначе увеличивает B
; In:
;   BC клетка
; Out:
;   BC новая клетка, AF изменён
; Corrupt:
;   BC и AF, меняются B и флаги, HL, DE, C, IX, IY сохранены
; -----------------------------------------
CellDown        LD A, B
                CP #04
                RET Z                                                           ; выход, если клетка уже в нижней строке

                INC B
                RET
