
; -----------------------------------------
; увеличить столбец клетки без выхода за правый край
; при C=7 оставляет столбец без изменения, иначе увеличивает C
; In:
;   BC клетка
; Out:
;   BC новая клетка, AF изменён
; Corrupt:
;   BC и AF, меняются C и флаги, HL, DE, B, IX, IY сохранены
; -----------------------------------------
CellRight       LD A, C
                CP #07
                RET Z                                                           ; выход, если клетка уже в правом столбце

                INC C
                RET
