
; -----------------------------------------
; пометить экранный объект клетки как пустой для перерисовки
; F626 получает IX объекта, поле +0 сохраняет только бит 7 и получает бит 0, IX, HL, AF
; сохраняются
; In:
;   BC клетка
; Out:
;   объект клетки помечен для обновления
; Corrupt:
;   поле 0 экранного объекта выбранной клетки, HL, DE, BC, AF, IX, IY сохранены
; -----------------------------------------
DirtyCell       PUSH IX
                PUSH HL
                PUSH AF
                CALL GetCellObject                                              ; получить экранный объект боевой клетки
                LD A, (IX + FScreenObject20.Flags)
                AND #80
                OR #01
                LD (IX + FScreenObject20.Flags), A
                POP AF
                POP HL
                POP IX
                RET
