
; -----------------------------------------
; оформить рамку заголовка боя цветом A
; задаёт BC=0000 и DE=021E, вызывает 73FE, исходные DE и BC сохраняет
; In:
;   A атрибут рамки
; Out:
;   рамка верхнего заголовка обновлена
; Corrupt:
;   HL, AF, пиксели и атрибуты рамки, рабочие поля 74AB..74EE, DE, BC, IX, IY сохранены
; -----------------------------------------
DrawHeader      PUSH DE
                PUSH BC
                LD BC, #0000
                LD DE, #021E
                CALL Engine.DrawFrame                                           ; нарисовать рамку окна из восьми одноклеточных элементов
                POP BC
                POP DE
                RET
