
; -----------------------------------------
; получить экранный объект боевой клетки
; увеличивает строку B на один для пропуска верхнего ряда интерфейса, вызывает 7341 и
; восстанавливает BC
; In:
;   BC клетка, C=0..7, B=0..4
; Out:
;   IX объект, HL связанное слово численности, BC сохранён
; Corrupt:
;   HL, AF и IX, в AF изменяются только флаги от INC B, DE, BC, A, IY сохранены
; -----------------------------------------
GetCellObject   PUSH BC
                INC B
                CALL Engine.ViewCellAddr                                        ; найти экранный объект клетки и связанное численное поле
                POP BC
                RET
