
; -----------------------------------------
; сохранить фон под курсором клетки
; клетка переводится в знакоместа 4*C,4*(B+1), Engine.GrabTile4x4 копирует прямоугольник в Background
; в буфере последовательно хранятся 128 пиксельных и 16 атрибутных байтов
; In:
;   BC клетка
; Out:
;   Background заполнен исходным изображением клетки
; Corrupt:
;   AF и 144 байта Background, HL, DE, BC, IX и IY сохранены
; -----------------------------------------
SaveCursorBack  PUSH DE
                PUSH BC
                INC B
                SLA B
                SLA B
                SLA C
                SLA C
                LD DE, Battle.SaveCursorBack.Background
                CALL Engine.GrabTile4x4                                         ; сохранить прямоугольник экрана 4 на 4 знакоместа в буфер DE
                POP BC
                POP DE
                RET

.Timer          DW #0000                                                        ; слово счётчика до следующего кадра курсора
.Frame          DB #00                                                          ; номер текущего кадра курсора
.Background     DB #00, #00, #00, #00, #00                                      ; 144 байта фона, 128 пиксельных и 16 атрибутных
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00
