
; -----------------------------------------
; показать название и параметры выбранного заклинания
; 8066 получает описатель заклинания по A, IX сохраняется в DC06 внутри текстового шаблона DC05,
; F618 оформляет заголовок, 7117 выводит одну строку
; In:
;   A номер заклинания
; Out:
;   IX описатель заклинания
; Corrupt:
;   HL, DE, BC, AF, IX, указатель текста DC06, экран и рабочие поля оформления рамки, IY
;   сохранён
; -----------------------------------------
ShowSpell       CALL Engine.SpellDesc                                           ; получить описатель одного из десяти заклинаний
                LD (Battle.PickOccupied.SpellName), IX
                LD A, #47
                CALL DrawHeader                                                 ; оформить рамку заголовка боя цветом A
                LD B, #01
                LD DE, Battle.PickOccupied.SpellText                            ; шаблон названия выбранного заклинания и приглашения выбрать армию
                CALL Engine.PrintMessage                                        ; разобрать строку сообщения с управляющими кодами
                RET
