
; -----------------------------------------
; получить два байта коэффициентов заклинания для типа существа
; номер B>=4 уменьшается на один, IX=FE66+50*B+2*C, читаются C и B, DE, AF, IX сохраняются, номер
; 4 «Телепортация» пропущен в упакованной таблице коэффициентов
; In:
;   B номер заклинания или эффекта >0, C ID типа
; Out:
;   BC табличное слово
; Corrupt:
;   BC, HL, DE, AF, IX, IY сохранены
; -----------------------------------------
SpellCoeffs     PUSH DE
                PUSH AF
                PUSH IX

                ; переход от номера эффекта к строке упакованной таблицы, для номера 4 отдельной строки нет
                LD A, B
                CP #04
                JR C, .CoefficientRow                                           ; переход, если номер группы меньше четырёх

                DEC B

                ; поиск строки коэффициентов, на один номер отведено 25 двухбайтовых значений
.CoefficientRow LD IX, Battle.SpecialTileMap.SpellFactors - 26 * FWord          ; смещённая база матрицы эффектов, ID строки и ID типа начинаются с1
                LD DE, #0032
.AdvanceType    ADD IX, DE
                DJNZ .AdvanceType

                ; выбор двухбайтового коэффициента типа существа внутри найденной строки
                SLA C
                ADD IX, BC
                LD C, (IX + FWord.Low)
                LD B, (IX + FWord.High)
                POP IX
                POP AF
                POP DE
                RET
