
; -----------------------------------------
; выдержать сорок кадров анимации перемещения
; B=40 и цикл HALT/DJNZ, исходный BC сохраняется
; In:
;   прерывания разрешены
; Out:
;   прошло сорок прерываний, BC сохранён
; Corrupt:
;   собственных изменений регистров или данных нет, BC восстановлен, исполнение ожидает сорок
;   прерываний
; -----------------------------------------
WaitMoveFrames  PUSH BC
                LD B, #28
.FrameLoop      HALT
                DJNZ .FrameLoop

                POP BC
                RET
