
; -----------------------------------------
; обнулить все пиксели и атрибуты ZX-экрана
; записывает ноль по 4000 и распространяет его LDIR с BC=1AFF из 4000 в 4001, общий диапазон
; 4000..5AFF составляет 6912 байтов, HL, DE, BC сохраняются, A не изменяется, флаги F меняет LDIR
; In:
;   регистровых аргументов нет, экранная память 4000..5AFF доступна для записи
; Out:
;   пиксели и атрибуты экрана нулевые, HL, DE, BC, A, IX, IY сохранены, флаги LDIR изменены
; Corrupt:
;   AF, меняются только флаги LDIR, экран 4000..5AFF, HL, DE, BC, A, IX, IY сохранены
; -----------------------------------------
ClearScreen     PUSH HL
                PUSH DE
                PUSH BC
                LD HL, Screen.Pixels                                            ; начало видимой пиксельной памяти экрана
                LD DE, Screen.Pixels + 1                                        ; второй байт очищаемого экрана, источник LDIR отстаёт на1
                LD (HL), #00
                LD BC, #1AFF
                LDIR
                POP BC
                POP DE
                POP HL
                RET

                DB #E5, #D5, #C5, #F5, #FB, #C5, #06, #32
                DB #76, #C5, #CD, #8E, #02, #C1, #7A, #A3
                DB #FE, #FF, #20, #05, #10, #F2, #C1, #10
                DB #EC, #F1, #C1, #D1, #E1, #C9
