
; -----------------------------------------
; загрузить именованный файл в заданную область через TR-DOS
; копирует девять байт имени и расширения из HL в 5CDD, записывает 0 в 5D10, исходный DE переносит
; в HL, задаёт C=0E и A=3, хвостовой JP 6DBC вызывает TR-DOS, длина выбирается из параметров файла
; In:
;   HL имя из восьми байтов и однобайтовый тип, DE адрес загрузки
; Out:
;   файл загружен через TR-DOS, I=60, IM2
; Corrupt:
;   HL, DE, BC, AF, IY
; -----------------------------------------
LoadFile        PUSH DE
                LD DE, TrDos.Descriptor                                         ; рабочий дескриптор имени и параметров файла TR-DOS
                LD BC, #0009
                LDIR
                XOR A
                LD (TrDos.Error), A
                POP HL
                LD C, #0E
                LD A, #03
                JP CallTrdos

.StateDiskText  EQU $                                                           ; приглашение вставить диск сохранений
                DB #82, #E1, #E2, #A0, #A2, #EC, #E2, #A5
                DB #20, #A4, #A8, #E1, #AA, #A5, #E2, #E3
                DB #20, #E1, #20, #E1, #AE, #E1, #E2, #AE
                DB #EF, #AD, #A8, #EF, #AC, #A8, #20, #2E
                DB #2E, #2E, #2E, #00, #32, #DD, #70, #83
                DB #07, #32, #DE, #70, #AE, #77, #23, #0B
                DB #78, #B1, #20, #E1, #C9, #00, #00, #00
