
; -----------------------------------------
; вычислить адрес верхней пиксельной строки знакоместа
; HL=4000+((B AND18)<<8)+((B AND7)<<5)+C, BC сохраняется, это адрес для первой из восьми
; пиксельных строк заданного ряда знакомест
; In:
;   BC позиция в знакоместах
; Out:
;   HL экранный адрес
; Corrupt:
;   HL, AF
; -----------------------------------------
ScreenCharAddr  PUSH BC
                LD HL, #0800
                LD A, B
                SRL A
                RR L
                SRL A
                RR L
                SRL A
                RR L
                OR H
                RLCA
                RLCA
                RLCA
                LD H, A
                LD B, #00
                ADD HL, BC
                POP BC
                RET
