
; -----------------------------------------
; продвижение пары трек-сектор на B секторов
; Увеличивает L, при L=#10 сбрасывает L и увеличивает H. Повторяет DJNZ. При исходном B=0
; выполняются 256 итераций.
; In:
;   HL — H трек, L сектор, B — число секторов
; Out:
;   HL — новая позиция, B=0
; Corrupt:
;   HL, BC, AF
; -----------------------------------------
AddSectors      INC L
                LD A, L
                CP #10
                JR NZ, .NextSector                                              ; переход, если следующий сектор остаётся на текущей дорожке

                INC H
                LD L, #00
.NextSector     DJNZ AddSectors

                RET
