
; -----------------------------------------
; биперный эффект с псевдослучайной задержкой
; Проверяет bit 0 MenuState.SoundFlags. Если звук включён, выводит MenuState.PortFE
; на порт #FE, чередует bit 4 через AF'.
; Между импульсами выдерживает задержку (случайный байт AND #7F)+E. D задаёт число импульсов.
; In:
;   D — число импульсов, E — добавка к задержке
; Out:
;   при выключенном звуке немедленный возврат
; Corrupt:
;   DE, BC, AF, AF'
; Note:
;   порт #FE, MenuState.BeepRandom
; -----------------------------------------
Beep            LD A, (MenuState.SoundFlags)
                RRA
                RET NC                                                          ; выход, если звуковые эффекты отключены

                LD A, (MenuState.PortFE)

                ; бит 4 порта #FE меняется между импульсами, псевдослучайная добавка изменяет
                ; длительность паузы
.Pulse          OUT (#FE), A
                XOR #10
                EX AF, AF'
                CALL RandomByte                                                 ; получение псевдослучайного байта для бипера
                AND #7F
                ADD A, E
                LD B, A
.PulseDelay     DJNZ .PulseDelay

                EX AF, AF'
                DEC D
                JR NZ, .Pulse                                                   ; переход, если остаются импульсы звукового эффекта

                RET
