
; -----------------------------------------
; очистка экранной памяти и заполнение атрибутов
; Распространяет ноль из #4000 через #5800 включительно. Затем заменяет #5800 значением A и
; распространяет его по #5801..#5AFF, заполняя все 768 атрибутов.
; In:
;   A — атрибут заполнения
; Out:
;   экран очищен, HL=#5AFF, DE=#5B00, BC=0
; Corrupt:
;   HL, DE, BC, AF
; Note:
;   #4000..#5AFF
; -----------------------------------------
ClearScreen     LD HL, Screen.Pixels                                            ; начало видимой пиксельной области Spectrum
                LD DE, Screen.Pixels + 1                                        ; следующий байт видимой пиксельной области для размножения заполнителя
                LD BC, #1800
                LD (HL), L
                LDIR
                LD (HL), A
                LD BC, #02FF
                LDIR
                RET
