; исходные данные с полями структур, размеры и размещение сохранены
                module Data
                module Battle
                org #C41A

MeleeFactors    ; 25 строк по 25 слов, используется #F3F5
VsPeasants      DW #1388, #07D0, #0190, #012C, #0064, #001C, #00C8, #0032       ; коэффициенты против типов 1..8
                DW #0096, #0535, #0320, #07D0, #0032, #002D, #0010, #0000       ; коэффициенты против типов 9..16
                DW #07D0, #05FD, #04B0, #00C8, #0021, #0320, #0028, #03AC       ; коэффициенты против типов 17..24
                DW #0000                                                        ; коэффициенты против типов 25..25
VsSoldiers      DW #19AA, #0C58, #012C, #0227, #00B4, #0067, #0140, #0118       ; коэффициенты против типов 1..8
                DW #0078, #091D, #0578, #0C58, #0069, #006D, #002E, #0007       ; коэффициенты против типов 9..16
                DW #12C0, #0D05, #0A28, #021C, #006A, #0640, #0090, #0510       ; коэффициенты против типов 17..24
                DW #001F                                                        ; коэффициенты против типов 25..25
VsArchers       DW #19AA, #0B68, #012C, #0227, #00B4, #0067, #0140, #0118       ; коэффициенты против типов 1..8
                DW #0078, #091D, #0578, #0C58, #0069, #006D, #002E, #0007       ; коэффициенты против типов 9..16
                DW #12C0, #0BD9, #0A28, #021C, #006A, #0640, #0090, #03E4       ; коэффициенты против типов 17..24
                DW #001F                                                        ; коэффициенты против типов 25..25
VsSpearmen      DW #27D8, #0FA0, #0320, #0245, #0114, #0077, #016C, #010D       ; коэффициенты против типов 1..8
                DW #0084, #07B5, #0540, #1388, #007E, #0078, #0044, #0010       ; коэффициенты против типов 9..16
                DW #0BB8, #08A5, #0830, #01D4, #0073, #04E0, #009A, #0490       ; коэффициенты против типов 17..24
                DW #0049                                                        ; коэффициенты против типов 25..25
VsCavalry       DW #6D60, #2EE0, #0960, #07D0, #0320, #0157, #0535, #03E8       ; коэффициенты против типов 1..8
                DW #0190, #1F40, #12C0, #2EE0, #0190, #016C, #00C8, #0028       ; коэффициенты против типов 9..16
                DW #36B0, #2710, #2260, #0640, #0190, #12C0, #01E0, #07BC       ; коэффициенты против типов 17..24
                DW #00B6                                                        ; коэффициенты против типов 25..25
VsKnights       DW #92E0, #3EE4, #0C08, #09D8, #047E, #01F7, #0758, #050A       ; коэффициенты против типов 1..8
                DW #0226, #2904, #19B4, #4C2C, #0226, #01F4, #0139, #0042       ; коэффициенты против типов 9..16
                DW #1F40, #2904, #206C, #092E, #023D, #1784, #02B0, #0A80       ; коэффициенты против типов 17..24
                DW #0139                                                        ; коэффициенты против типов 25..25
VsNomads        DW #4F4C, #2328, #035C, #06D6, #0230, #00F9, #03E8, #02D5       ; коэффициенты против типов 1..8
                DW #014A, #1388, #0D20, #2328, #00F0, #00F5, #0096, #001B       ; коэффициенты против типов 9..16
                DW #2BC0, #1E78, #19C8, #0488, #0140, #0F00, #018C, #03D8       ; коэффициенты против типов 17..24
                DW #008C                                                        ; коэффициенты против типов 25..25
VsCelts         DW #5A3C, #1FA4, #0708, #05AA, #02E4, #0112, #044C, #02BC       ; коэффициенты против типов 1..8
                DW #015E, #1770, #0E10, #0FA0, #0122, #0111, #00AF, #001D       ; коэффициенты против типов 9..16
                DW #2710, #1DB0, #18D8, #0550, #00FA, #0F78, #0005, #040C       ; коэффициенты против типов 17..24
                DW #0096                                                        ; коэффициенты против типов 25..25
VsVikings       DW #6D60, #2904, #087A, #05A0, #03CF, #01C9, #0578, #03DE       ; коэффициенты против типов 1..8
                DW #01C2, #1E14, #1180, #14A0, #0190, #01B0, #00C1, #004B       ; коэффициенты против типов 9..16
                DW #2EE0, #208D, #1ACC, #073A, #0175, #143C, #01B0, #0680       ; коэффициенты против типов 17..24
                DW #00C6                                                        ; коэффициенты против типов 25..25
VsWolves        DW #2A30, #1388, #044C, #0320, #00B4, #007E, #0258, #0168       ; коэффициенты против типов 1..8
                DW #0096, #07D0, #0708, #01E0, #0096, #005F, #003C, #000A       ; коэффициенты против типов 9..16
                DW #1770, #123B, #0DDE, #021C, #0085, #0A28, #00C0, #0478       ; коэффициенты против типов 17..24
                DW #0037                                                        ; коэффициенты против типов 25..25
VsOrcs          DW #35E8, #186A, #04B0, #03E8, #0177, #008F, #0280, #0190       ; коэффициенты против типов 1..8
                DW #00B4, #1047, #0898, #0320, #00AD, #00AA, #0050, #000C       ; коэффициенты против типов 9..16
                DW #2260, #19C8, #159C, #02B2, #00AD, #09C4, #00C0, #04B0       ; коэффициенты против типов 17..24
                DW #0036                                                        ; коэффициенты против типов 25..25
VsElves         DW #20D0, #0E10, #0384, #0384, #0118, #0092, #0215, #015E       ; коэффициенты против типов 1..8
                DW #0096, #0C80, #0690, #2710, #00A0, #00AD, #004B, #0010       ; коэффициенты против типов 9..16
                DW #1F40, #16A8, #1248, #01E0, #0096, #0780, #009C, #02B4       ; коэффициенты против типов 17..24
                DW #0049                                                        ; коэффициенты против типов 25..25
VsOgres         DW #5AA0, #2FDA, #0AAA, #0780, #0352, #0179, #0528, #03FC       ; коэффициенты против типов 1..8
                DW #015E, #22A3, #1068, #2FA8, #01C2, #01DD, #00E9, #0035       ; коэффициенты против типов 9..16
                DW #4970, #1E14, #15F4, #079E, #01ED, #15E0, #0250, #05D8       ; коэффициенты против типов 17..24
                DW #00E7                                                        ; коэффициенты против типов 25..25
VsTrolls        DW #37E6, #16D0, #0520, #047C, #01B9, #00D2, #0384, #0280       ; коэффициенты против типов 1..8
                DW #00D5, #0DF5, #0900, #143F, #00C0, #0078, #00DE, #001D       ; коэффициенты против типов 9..16
                DW #3354, #217D, #18F0, #0342, #00FC, #0960, #0126, #0126       ; коэффициенты против типов 17..24
                DW #0081                                                        ; коэффициенты против типов 25..25
VsGiants        DW #8020, #3412, #0B7C, #0960, #044C, #0202, #0640, #0474       ; коэффициенты против типов 1..8
                DW #01C2, #255F, #1554, #3AD4, #01BB, #010B, #020D, #003C       ; коэффициенты против типов 9..16
                DW #39D0, #255F, #1D24, #07D0, #0215, #143C, #0290, #0E58       ; коэффициенты против типов 17..24
                DW #012C                                                        ; коэффициенты против типов 25..25
VsDragons       DW #8D68, #4164, #0DC8, #0CB8, #0560, #02BA, #0860, #0580       ; коэффициенты против типов 1..8
                DW #02BE, #2B5C, #1C8C, #5A70, #028F, #022A, #0174, #0060       ; коэффициенты против типов 9..16
                DW #8B74, #2CE2, #2788, #0A5D, #02DE, #1B48, #039E, #1AB6       ; коэффициенты против типов 17..24
                DW #01A7                                                        ; коэффициенты против типов 25..25
VsGhosts        DW #1B58, #0C80, #0280, #01A4, #008C, #0033, #0140, #0046       ; коэффициенты против типов 1..8
                DW #00D2, #0960, #0500, #01A4, #003C, #003F, #001A, #0000       ; коэффициенты против типов 9..16
                DW #0FA0, #0640, #0460, #0140, #0028, #05A0, #0038, #00C4       ; коэффициенты против типов 17..24
                DW #0000                                                        ; коэффициенты против типов 25..25
VsSkeletons     DW #2580, #0FA0, #0384, #0230, #00D2, #005B, #015B, #0062       ; коэффициенты против типов 1..8
                DW #0140, #0B11, #05DC, #1608, #0062, #0057, #0032, #0009       ; коэффициенты против типов 9..16
                DW #1388, #09C4, #0708, #01A4, #0064, #0708, #0070, #026C       ; коэффициенты против типов 17..24
                DW #001B                                                        ; коэффициенты против типов 25..25
VsZombies       DW #2EE0, #1388, #03E8, #0320, #012C, #0072, #0215, #0096       ; коэффициенты против типов 1..8
                DW #0190, #0D05, #07D0, #16A8, #0096, #0088, #0043, #000A       ; коэффициенты против типов 9..16
                DW #1770, #0D05, #07D0, #0258, #0085, #07D0, #00A0, #04EC       ; коэффициенты против типов 17..24
                DW #002D                                                        ; коэффициенты против типов 25..25
VsSpectres      DW #6D60, #2E7C, #0906, #07F8, #036B, #0185, #05A0, #01C4       ; коэффициенты против типов 1..8
                DW #03FC, #1EFD, #13B0, #1040, #01DB, #0182, #00E3, #0035       ; коэффициенты против типов 9..16
                DW #6A40, #1E14, #143C, #0640, #01B8, #1324, #0230, #0260       ; коэффициенты против типов 17..24
                DW #00F5                                                        ; коэффициенты против типов 25..25
VsVampires      DW #9AB0, #44C0, #0E60, #0AAA, #0618, #02AD, #07A8, #02C1       ; коэффициенты против типов 1..8
                DW #0555, #2DD5, #1C20, #0C4E, #0267, #0281, #0190, #005E       ; коэффициенты против типов 9..16
                DW #4E20, #2FEA, #1AE0, #0B7C, #0320, #1AE0, #03FC, #0334       ; коэффициенты против типов 17..24
                DW #017D                                                        ; коэффициенты против типов 25..25
VsDwarves       DW #2710, #0CB2, #0384, #02D0, #012C, #0080, #0215, #00A5       ; коэффициенты против типов 1..8
                DW #01A4, #0D05, #07D0, #02F8, #0080, #0096, #003C, #000D       ; коэффициенты против типов 9..16
                DW #1644, #0EF9, #0834, #01FE, #0078, #06A4, #0044, #00A8       ; коэффициенты против типов 17..24
                DW #0030                                                        ; коэффициенты против типов 25..25
VsDruids        DW #0870, #0398, #00B8, #00AF, #0048, #0020, #0079, #0025       ; коэффициенты против типов 1..8
                DW #005E, #0265, #0170, #00C7, #0024, #0022, #0014, #0004       ; коэффициенты против типов 9..16
                DW #0DDE, #02B5, #0170, #0090, #0026, #0180, #002E, #0162       ; коэффициенты против типов 17..24
                DW #0017                                                        ; коэффициенты против типов 25..25
VsWarlocks      DW #08CA, #0410, #00D0, #00B6, #0048, #0023, #007E, #0024       ; коэффициенты против типов 1..8
                DW #0057, #02EA, #01C0, #00A1, #0024, #0024, #0014, #0005       ; коэффициенты против типов 9..16
                DW #1194, #0280, #0190, #009C, #0024, #0180, #0014, #0014       ; коэффициенты против типов 17..24
                DW #0019                                                        ; коэффициенты против типов 25..25
VsDemons        DW #DEA8, #6CFC, #1518, #1270, #085C, #03F3, #0D20, #03C3       ; коэффициенты против типов 1..8
                DW #09B0, #4650, #2AE4, #1310, #042C, #03BB, #024E, #0098       ; коэффициенты против типов 9..16
                DW #EA60, #4B00, #2B98, #1180, #049C, #297C, #05B8, #0570       ; коэффициенты против типов 17..24
                DW #02B5                                                        ; коэффициенты против типов 25..25
.RangedFactors  EQU $                                                           ; семь строк по25слов коэффициентов дальнего воздействия, смещения задаёт RangedRules
                DB #28, #23, #A0, #0F, #20, #03, #58, #02
                DB #E1, #00, #56, #00, #8D, #01, #71, #00
                DB #F0, #00, #DC, #05, #DC, #05, #08, #02
                DB #71, #00, #74, #00, #39, #00, #08, #00
                DB #32, #00, #5A, #00, #DC, #05, #A4, #01
                DB #78, #00, #B0, #04, #80, #00, #88, #00
                DB #20, #00, #D8, #27, #88, #13, #4C, #04
                DB #D0, #02, #4A, #01, #8F, #00, #30, #02
                DB #BC, #00, #E0, #01, #A4, #06, #98, #08
                DB #98, #03, #B4, #00, #74, #00, #50, #00
                DB #08, #00, #28, #00, #46, #00, #08, #07
                DB #E0, #01, #93, #00, #D0, #07, #90, #00
                DB #88, #00, #2B, #00, #08, #52, #AC, #26
                DB #DC, #05, #14, #05, #08, #02, #1B, #01
                DB #C7, #03, #4A, #01, #EE, #02, #D0, #07
                DB #10, #0E, #AA, #05, #18, #01, #2C, #01
                DB #A5, #00, #1F, #00, #84, #03, #E8, #03
                DB #10, #0E, #60, #04, #18, #01, #B8, #0B
                DB #50, #01, #50, #01, #84, #00, #50, #19
                DB #80, #0C, #60, #02, #06, #02, #D8, #00
                DB #72, #00, #7F, #01, #7E, #00, #F5, #00
                DB #B5, #07, #E0, #04, #EA, #01, #66, #00
                DB #65, #00, #43, #00, #0F, #00, #9C, #18
                DB #C0, #08, #40, #05, #EC, #01, #82, #00
                DB #C0, #04, #94, #00, #A0, #00, #41, #00
                DB #06, #27, #30, #11, #DC, #05, #B0, #04
                DB #4A, #01, #9D, #00, #01, #02, #A5, #00
                DB #81, #01, #75, #0B, #EA, #06, #02, #03
                DB #A5, #00, #96, #00, #5C, #00, #00, #00
                DB #AC, #26, #75, #0B, #00, #0A, #94, #02
                DB #B7, #00, #E0, #06, #DC, #00, #DC, #00
                DB #64, #00, #50, #46, #4C, #1D, #DC, #05
                DB #B0, #04, #C2, #01, #AB, #00, #20, #03
                DB #E1, #00, #58, #02, #88, #13, #B8, #0B
                DB #B0, #04, #E1, #00, #CD, #00, #64, #00
                DB #00, #00, #50, #46, #88, #13, #B8, #0B
                DB #84, #03, #C8, #00, #B8, #0B, #F0, #00
                DB #F0, #00, #44, #00, #D8, #59, #A0, #28
                DB #20, #08, #25, #07, #0C, #03, #73, #01
                DB #BD, #04, #86, #01, #8E, #03, #15, #1B
                DB #40, #10, #1C, #07, #86, #01, #63, #01
                DB #D9, #00, #00, #00, #D8, #59, #15, #1B
                DB #40, #10, #18, #06, #B1, #01, #40, #10
.Morale         EQU $+6                                                         ; 25 на25 байтов совместимости типов, первый фактический элемент ID1/ID1
                DB #08, #02, #08, #02, #EC, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #FF, #FF
                DB #FF, #00, #FF, #FF, #00, #FF, #00, #FF
                DB #FF, #FF, #FF, #00, #00, #FF, #FF, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #FF, #00, #FF, #FF, #00, #FF, #00
                DB #FF, #FF, #FF, #FF, #00, #00, #FF, #FF
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #FF, #00, #FF, #FF, #00, #FF
                DB #00, #FF, #FF, #FF, #FF, #00, #00, #FF
                DB #FF, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #FF, #FF, #00
                DB #FF, #00, #FF, #FF, #FF, #FF, #00, #00
                DB #FF, #FF, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #FF, #FF
                DB #00, #FF, #00, #FF, #FF, #FF, #FF, #00
                DB #00, #FF, #FF, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #FF
                DB #FF, #00, #00, #00, #FF, #FF, #FF, #FF
                DB #00, #00, #00, #FF, #00, #00, #00, #00
                DB #00, #00, #01, #01, #01, #01, #00, #01
                DB #FF, #FF, #00, #FF, #FF, #FF, #FF, #FF
                DB #FF, #00, #01, #00, #FF, #00, #00, #00
                DB #00, #00, #00, #01, #01, #01, #01, #01
                DB #FF, #FF, #00, #00, #FF, #FF, #FF, #FF
                DB #FF, #FF, #00, #00, #00, #FF, #00, #00
                DB #00, #00, #00, #00, #01, #01, #01, #00
                DB #00, #01, #FF, #00, #01, #00, #00, #FF
                DB #FF, #FF, #FF, #00, #01, #01, #00, #00
                DB #00, #00, #00, #00, #00, #FF, #00, #00
                DB #01, #01, #FF, #00, #00, #00, #FF, #FF
                DB #FF, #FF, #FF, #FF, #00, #00, #00, #FF
                DB #00, #00, #00, #00, #00, #00, #00, #01
                DB #00, #01, #01, #FF, #01, #01, #00, #01
                DB #00, #FF, #FF, #00, #FF, #FF, #00, #00
                DB #FF, #00, #00, #00, #00, #00, #00, #01
                DB #01, #01, #01, #FF, #01, #FF, #FF, #01
                DB #00, #00, #FF, #FF, #00, #FF, #01, #01
                DB #01, #00, #01, #01, #01, #01, #01, #01
                DB #01, #00, #00, #00, #00, #FF, #01, #00
                DB #00, #00, #00, #FF, #FF, #FF, #FF, #00
                DB #FF, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #01, #01, #01, #FF, #01
                DB #01, #00, #00, #FF, #FF, #FF, #FF, #FF
                DB #FF, #FF, #FF, #FF, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #FF, #FF, #01
                DB #00, #00, #01, #00, #00, #FF, #FF, #FF
                DB #FF, #00, #01, #01, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #01, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #01, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #01, #01, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #01, #01, #01, #01, #00, #00, #00, #01
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #01, #01, #01, #01, #00, #00, #00
                DB #01, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #01, #00, #01, #00, #00, #00
                DB #00, #01, #01, #01, #01, #01, #00, #00
                DB #01, #01, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #01, #01, #01, #01, #01, #00
                DB #00, #00, #01, #00, #00, #00, #00, #00
                DB #00, #01, #01, #00, #00, #00, #01, #FF
                DB #FF, #01, #00, #01, #FF, #FF, #FF, #FF
                DB #01, #01, #01, #FF, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #01, #00, #00, #00, #01
                DB #00, #00, #01, #01, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #01, #00, #00, #00, #01, #00, #00, #00
                DB #01, #00, #00, #01, #01, #01, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #00, #00, #00, #00, #00, #00, #00
                DB #00, #01, #01, #00, #01, #01, #01

Ruler01         ; FRuler, исходная запись
.Name           DB #92, #A5, #E0, #A0, #E0, #AD, #20, #83                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #A0, #E8, #E2, #A5, #AA, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler01 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler01 = FRuler.Terminator
.Mana           DW #0000                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler01 = FRuler.Mana
.ManaMax        DW #0000                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler01 = FRuler.ManaMax
.ManaRegen      DW #0000                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler01 = FRuler.ManaRegen
                assert $ - Ruler01 = FRuler

Ruler02         ; FRuler, исходная запись
.Name           DB #83, #A5, #E0, #E6, #AE, #A3, #20, #83                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #AB, #A0, #AD, #A4, #A8, #E2, #2D, #A0                       ; продолжение поля Name
                DB #2D, #8A, #E0, #A0, #A9                                      ; продолжение поля Name
                assert .Name - Ruler02 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler02 = FRuler.Terminator
.Mana           DW #0000                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler02 = FRuler.Mana
.ManaMax        DW #0000                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler02 = FRuler.ManaMax
.ManaRegen      DW #0000                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler02 = FRuler.ManaRegen
                assert $ - Ruler02 = FRuler

Ruler03         ; FRuler, исходная запись
.Name           DB #8A, #AE, #E0, #AE, #AB, #EC, #20, #8B                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #A8, #E0, #2D, #A0, #2D, #81, #E0, #AE                       ; продолжение поля Name
                DB #A4, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler03 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler03 = FRuler.Terminator
.Mana           DW #00C8                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler03 = FRuler.Mana
.ManaMax        DW #1B58                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler03 = FRuler.ManaMax
.ManaRegen      DW #0014                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler03 = FRuler.ManaRegen
                assert $ - Ruler03 = FRuler

Ruler04         ; FRuler, исходная запись
.Name           DB #8F, #E0, #A8, #AD, #E6, #20, #98, #E3                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #AB, #EC, #2D, #A0, #AD, #2D, #84, #A6                       ; продолжение поля Name
                DB #A0, #A9, #A2, #A0, #AD                                      ; продолжение поля Name
                assert .Name - Ruler04 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler04 = FRuler.Terminator
.Mana           DW #0190                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler04 = FRuler.Mana
.ManaMax        DW #2710                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler04 = FRuler.ManaMax
.ManaRegen      DW #001E                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler04 = FRuler.ManaRegen
                assert $ - Ruler04 = FRuler

Ruler05         ; FRuler, исходная запись
.Name           DB #83, #A5, #A9, #AD, #AE, #E0, #20, #AF                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #E0, #AE, #AA, #AB, #EF, #E2, #EB, #A9                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler05 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler05 = FRuler.Terminator
.Mana           DW #01F4                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler05 = FRuler.Mana
.ManaMax        DW #3A98                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler05 = FRuler.ManaMax
.ManaRegen      DW #0032                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler05 = FRuler.ManaRegen
                assert $ - Ruler05 = FRuler

Ruler06         ; FRuler, исходная запись
.Name           DB #8A, #AE, #E0, #AE, #AB, #EC, #20, #93                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #E0, #AB, #A5, #E5, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler06 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler06 = FRuler.Terminator
.Mana           DW #02BC                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler06 = FRuler.Mana
.ManaMax        DW #3A98                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler06 = FRuler.ManaMax
.ManaRegen      DW #003C                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler06 = FRuler.ManaRegen
                assert $ - Ruler06 = FRuler

Ruler07         ; FRuler, исходная запись
.Name           DB #8F, #E0, #A8, #AD, #E6, #20, #89, #A8                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #E0, #AA, #A0, #AD, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler07 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler07 = FRuler.Terminator
.Mana           DW #02EE                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler07 = FRuler.Mana
.ManaMax        DW #4074                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler07 = FRuler.ManaMax
.ManaRegen      DW #003C                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler07 = FRuler.ManaRegen
                assert $ - Ruler07 = FRuler

Ruler08         ; FRuler, исходная запись
.Name           DB #94, #AE, #A9, #20, #8C, #EC, #A5, #E0                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #20, #20, #20, #20, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler08 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler08 = FRuler.Terminator
.Mana           DW #0258                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler08 = FRuler.Mana
.ManaMax        DW #2710                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler08 = FRuler.ManaMax
.ManaRegen      DW #0014                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler08 = FRuler.ManaRegen
                assert $ - Ruler08 = FRuler

Ruler09         ; FRuler, исходная запись
.Name           DB #97, #A0, #E0, #AE, #A4, #A5, #A9, #20                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #80, #E2, #AB, #A0, #AD, #E2, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler09 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler09 = FRuler.Terminator
.Mana           DW #01F4                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler09 = FRuler.Mana
.ManaMax        DW #4E20                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler09 = FRuler.ManaMax
.ManaRegen      DW #0032                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler09 = FRuler.ManaRegen
                assert $ - Ruler09 = FRuler

Ruler10         ; FRuler, исходная запись
.Name           DB #82, #A0, #AB, #A5, #E2, #20, #AC, #A5                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #E7, #A5, #A9, #20, #80, #E0, #A8, #AE                       ; продолжение поля Name
                DB #E5, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler10 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler10 = FRuler.Terminator
.Mana           DW #0320                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler10 = FRuler.Mana
.ManaMax        DW #55F0                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler10 = FRuler.ManaMax
.ManaRegen      DW #0046                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler10 = FRuler.ManaRegen
                assert $ - Ruler10 = FRuler

Ruler11         ; FRuler, исходная запись
.Name           DB #8A, #AE, #AB, #A4, #E3, #AD, #20, #8A                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #E1, #A8, #AE, #AC, #A1, #A0, #E0, #A3                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler11 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler11 = FRuler.Terminator
.Mana           DW #0384                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler11 = FRuler.Mana
.ManaMax        DW #5DC0                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler11 = FRuler.ManaMax
.ManaRegen      DW #0050                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler11 = FRuler.ManaRegen
                assert $ - Ruler11 = FRuler

Ruler12         ; FRuler, исходная запись
.Name           DB #8A, #AE, #E0, #AE, #AB, #EC, #20, #AC                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #A5, #E7, #A5, #A9, #20, #8C, #A0, #A1                       ; продолжение поля Name
                DB #A5, #AB, #E0, #AE, #A4                                      ; продолжение поля Name
                assert .Name - Ruler12 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler12 = FRuler.Terminator
.Mana           DW #0384                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler12 = FRuler.Mana
.ManaMax        DW #6590                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler12 = FRuler.ManaMax
.ManaRegen      DW #0064                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler12 = FRuler.ManaRegen
                assert $ - Ruler12 = FRuler

Ruler13         ; FRuler, исходная запись
.Name           DB #82, #AB, #A0, #A4, #EB, #AA, #A0, #20                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #90, #A8, #AD, #AD, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler13 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler13 = FRuler.Terminator
.Mana           DW #03E8                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler13 = FRuler.Mana
.ManaMax        DW #7530                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler13 = FRuler.ManaMax
.ManaRegen      DW #0064                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler13 = FRuler.ManaRegen
                assert $ - Ruler13 = FRuler

Ruler14         ; FRuler, исходная запись
.Name           DB #82, #AB, #A0, #A4, #EB, #AA, #A0, #20                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #8A, #E3, #AB, #AB, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler14 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler14 = FRuler.Terminator
.Mana           DW #03E8                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler14 = FRuler.Mana
.ManaMax        DW #7918                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler14 = FRuler.ManaMax
.ManaRegen      DW #0064                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler14 = FRuler.ManaRegen
                assert $ - Ruler14 = FRuler

Ruler15         ; FRuler, исходная запись
.Name           DB #82, #AB, #A0, #A4, #EB, #AA, #A0, #20                       ; FRuler.Name, смещение #00, 21 символ имени вражеского правителя, дополнение пробелами
                DB #E2, #EC, #AC, #EB, #20, #91, #A0, #E3                       ; продолжение поля Name
                DB #E0, #AE, #AD, #20, #20                                      ; продолжение поля Name
                assert .Name - Ruler15 = FRuler.Name
.Terminator     DB #00                                                          ; FRuler.Terminator, смещение #15, ноль после имени
                assert .Terminator - Ruler15 = FRuler.Terminator
.Mana           DW #0898                                                        ; FRuler.Mana, смещение #16, текущая магическая сила
                assert .Mana - Ruler15 = FRuler.Mana
.ManaMax        DW #FFDC                                                        ; FRuler.ManaMax, смещение #18, максимум магической силы
                assert .ManaMax - Ruler15 = FRuler.ManaMax
.ManaRegen      DW #0064                                                        ; FRuler.ManaRegen, смещение #1A, пополнение магической силы за вызов восстановления
                assert .ManaRegen - Ruler15 = FRuler.ManaRegen
                assert $ - Ruler15 = FRuler

Freeze          ; FSpell, исходная запись
.Name           DB #87, #A0, #AC, #AE, #E0, #AE, #A7, #AA                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #A0, #20, #20, #20, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Freeze = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Freeze = FSpell.Terminator
.ManaCost       DW #00C8                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Freeze = FSpell.ManaCost
                assert $ - Freeze = FSpell

Blind           ; FSpell, исходная запись
.Name           DB #8E, #E1, #AB, #A5, #AF, #AB, #A5, #AD                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #A8, #A5, #20, #20, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Blind = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Blind = FSpell.Terminator
.ManaCost       DW #012C                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Blind = FSpell.ManaCost
                assert $ - Blind = FSpell

BallLightning   ; FSpell, исходная запись
.Name           DB #98, #A0, #E0, #AE, #A2, #A0, #EF, #20                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #AC, #AE, #AB, #AD, #A8, #EF, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - BallLightning = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - BallLightning = FSpell.Terminator
.ManaCost       DW #01F4                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - BallLightning = FSpell.ManaCost
                assert $ - BallLightning = FSpell

Teleport        ; FSpell, исходная запись
.Name           DB #92, #A5, #AB, #A5, #AF, #AE, #E0, #E2                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #A0, #E6, #A8, #EF, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Teleport = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Teleport = FSpell.Terminator
.ManaCost       DW #0226                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Teleport = FSpell.ManaCost
                assert $ - Teleport = FSpell

Banish          ; FSpell, исходная запись
.Name           DB #82, #A5, #E0, #AD, #E3, #E2, #EC, #20                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #A2, #20, #AC, #AE, #A3, #A8, #AB, #E3                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Banish = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Banish = FSpell.Terminator
.ManaCost       DW #0258                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Banish = FSpell.ManaCost
                assert $ - Banish = FSpell

Clone           ; FSpell, исходная запись
.Name           DB #8A, #AB, #AE, #AD, #A8, #E0, #AE, #A2                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #A0, #AD, #A8, #A5, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Clone = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Clone = FSpell.Terminator
.ManaCost       DW #0384                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Clone = FSpell.ManaCost
                assert $ - Clone = FSpell

Wall            ; FSpell, исходная запись
.Name           DB #82, #AE, #AB, #E8, #A5, #A1, #AD, #A0                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #EF, #20, #E1, #E2, #A5, #AD, #A0, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Wall = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Wall = FSpell.Terminator
.ManaCost       DW #0064                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Wall = FSpell.ManaCost
                assert $ - Wall = FSpell

Invisible       ; FSpell, исходная запись
.Name           DB #8D, #A5, #A2, #A8, #A4, #A8, #AC, #AE                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #E1, #E2, #EC, #20, #20, #20, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - Invisible = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Invisible = FSpell.Terminator
.ManaCost       DW #0BB8                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Invisible = FSpell.ManaCost
                assert $ - Invisible = FSpell

MagicWard       ; FSpell, исходная запись
.Name           DB #8C, #A0, #A3, #A8, #E7, #A5, #E1, #AA                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #A8, #A9, #20, #E9, #A8, #E2, #20, #20                       ; продолжение поля Name
                DB #20, #20, #20, #20                                           ; продолжение поля Name
                assert .Name - MagicWard = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - MagicWard = FSpell.Terminator
.ManaCost       DW #0FA0                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - MagicWard = FSpell.ManaCost
                assert $ - MagicWard = FSpell

Subjugate       ; FSpell, исходная запись
.Name           DB #8F, #AE, #A4, #E7, #A8, #AD, #A8, #E2                       ; FSpell.Name, смещение #00, 20 символов названия заклинания, дополнение пробелами
                DB #EC, #20, #E1, #A2, #AE, #A5, #A9, #20                       ; продолжение поля Name
                DB #A2, #AE, #AB, #A5                                           ; продолжение поля Name
                assert .Name - Subjugate = FSpell.Name
.Terminator     DB #00                                                          ; FSpell.Terminator, смещение #14, ноль после имени
                assert .Terminator - Subjugate = FSpell.Terminator
.ManaCost       DW #4650                                                        ; FSpell.ManaCost, смещение #15, магическая стоимость, также служит основанием цены изучения с множителем 100 и модификатором секты
                assert .ManaCost - Subjugate = FSpell.ManaCost
                assert $ - Subjugate = FSpell
AttackPixels    INCBIN "Assets/Gfx/raw/DATA1_attack.ink"                        ; встроенный графический ресурс
AttackMask      INCBIN "Assets/Gfx/raw/DATA1_attack.mask"                       ; встроенный графический ресурс
CursorFrame1    INCBIN "Assets/Gfx/raw/DATA1_select_frame_1.bin"                ; встроенный графический ресурс
CursorFrame2    INCBIN "Assets/Gfx/raw/DATA1_select_frame_2.bin"                ; встроенный графический ресурс
CursorFrame3    INCBIN "Assets/Gfx/raw/DATA1_select_frame_3.bin"                ; встроенный графический ресурс
CursorFrame4    INCBIN "Assets/Gfx/raw/DATA1_select_frame_4.bin"                ; встроенный графический ресурс

                assert $ = #D255
                endmodule
                endmodule
